#### 1. Import pandas library

In [1]:
import pandas as pd

#### 2. Import pymysql and sqlalchemy as you have learnt in the lesson of importing/exporting data

In [7]:
import pymysql
import sqlalchemy
from sqlalchemy import create_engine

#### 3. Create a mysql engine to set the connection to the server. Check the connection details in [this link](https://relational.fit.cvut.cz/search?tableCount%5B%5D=0-10&tableCount%5B%5D=10-30&dataType%5B%5D=Numeric&databaseSize%5B%5D=KB&databaseSize%5B%5D=MB)

In [20]:
engine=create_engine('mysql+pymysql://guest:relational@relational.fit.cvut.cz:3306/stats')

#### 4. Import the users table

In [29]:
users = pd.read_sql('SELECT * FROM users;', engine)

#### 5. Rename Id column to userId

In [32]:
users.rename(columns={'Id':'userId'},inplace = True)

#### 6. Import the posts table.

In [33]:
posts = pd.read_sql('SELECT * FROM posts;', engine)

#### 7. Rename Id column to postId and OwnerUserId to userId

In [36]:
posts.rename(columns={'Id':'postId','OwnerUserId':'userId'},inplace=True)

#### 8. Define new dataframes for users and posts with the following selected columns:
    **users columns**: userId, Reputation,Views,UpVotes,DownVotes
    **posts columns**: postId, Score,userID,ViewCount,CommentCount

In [39]:
users1 = users[['userId', 'Reputation','Views','UpVotes','DownVotes']]
posts1 = posts[['postId', 'Score','userId','ViewCount','CommentCount']]

#### 8. Merge both dataframes, users and posts. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [41]:
merged_df = posts1.merge(users1,how='inner',on='userId')

In [49]:
merged_df['ViewCount'].value_counts()

38.0       295
31.0       293
37.0       277
27.0       277
24.0       274
          ...
11653.0      1
2904.0       1
3937.0       1
4306.0       1
7974.0       1
Name: ViewCount, Length: 3654, dtype: int64

#### 9. How many missing values do you have in your merged dataframe? On which columns?

In [56]:
merged_df.isnull().sum()

postId              0
Score               0
userId              0
ViewCount       48396
CommentCount        0
Reputation          0
Views               0
UpVotes             0
DownVotes           0
dtype: int64

#### 10. You will need to make something with missing values.  Will you clean or filling them? Explain. 
**Remember** to check the results of your code before passing to the next step

The column with many null values is ViewCount, which indicates the number of timer a post has veen seen. Many NaN rows have commnts, score and upvotes, so I would either delete them or assign the mean column value to each NaN row.

#### 11. Adjust the data types in order to avoid future issues. Which ones should be changed?

In [60]:
merged_df.head()

,postId,Score,userId,ViewCount,CommentCount,Reputation,Views,UpVotes,DownVotes
0,1,23,8.0,1278.0,1,6764,1089,604,25
1,16,16,8.0,NaN,3,6764,1089,604,25
2,36,41,8.0,67396.0,7,6764,1089,604,25
3,65,14,8.0,NaN,3,6764,1089,604,25
4,78,33,8.0,NaN,4,6764,1089,604,25

In [61]:
merged_df.dtypes

postId            int64
Score             int64
userId          float64
ViewCount       float64
CommentCount      int64
Reputation        int64
Views             int64
UpVotes           int64
DownVotes         int64
dtype: object

In [66]:
merged_df['userId'] = merged_df['userId'].astype(int)

In [69]:
merged_df.loc[merged_df['ViewCount'].isnull()] = merged_df['ViewCount'].mean()

In [70]:
merged_df.isnull().sum()

postId          0
Score           0
userId          0
ViewCount       0
CommentCount    0
Reputation      0
Views           0
UpVotes         0
DownVotes       0
dtype: int64

In [71]:
merged_df['ViewCount'] = merged_df['ViewCount'].astype(int)

In [72]:
merged_df.head()

,postId,Score,userId,ViewCount,CommentCount,Reputation,Views,UpVotes,DownVotes
0,1.000000,23.000000,8.000000,1278,1.000000,6764.000000,1089.000000,604.000000,25.000000
1,556.656158,556.656158,556.656158,556,556.656158,556.656158,556.656158,556.656158,556.656158
2,36.000000,41.000000,8.000000,67396,7.000000,6764.000000,1089.000000,604.000000,25.000000
3,556.656158,556.656158,556.656158,556,556.656158,556.656158,556.656158,556.656158,556.656158
4,556.656158,556.656158,556.656158,556,556.656158,556.656158,556.656158,556.656158,556.656158

#### Bonus: Identify extreme values in your merged dataframe as you have learned in class, create a dataframe called outliers with the same columns as our data set and calculate the bounds. The values of the outliers dataframe will be the values of the merged_df that fall outside that bounds. You will need to save your outliers dataframe to a csv file on your-code folder.